app/controllers/user_controller.rb

  def index
    @title = "EasyConnect Command Center"
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

  def register
    @title = "Register"
    if param_posted?(:user)
      @user = User.new(params[:user])
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "password", "screen_name", "email") VALUES('2010-10-23 04:00:45', '2010-10-23 04:00:45', 'long_enough_to_pass', 'new_screen_name', 'valid@email.com')

  def login
    @title = "Login to EasyConnect"
    if param_posted?(:user)
      @user = User.new(params[:user])
      user = User.find_by_screen_name_and_password(@user.screen_name, @user.password)
---
SELECT * FROM "users" WHERE ("users"."screen_name" = 'robin' AND "users"."password" = 'testingaddon') LIMIT 1

  def edit
    @title = "Edit basic info"
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)